<template><div><h1 id="自我介绍" tabindex="-1"><a class="header-anchor" href="#自我介绍" aria-hidden="true">#</a> 自我介绍</h1>
<hr>
<h2 id="身份" tabindex="-1"><a class="header-anchor" href="#身份" aria-hidden="true">#</a> 身份</h2>
<p><s>我是一名保安，爱吃小熊饼干，工资只够早餐，上班为了下班，整天郁郁寡欢，若你识得伯乐，我会保你平安！</s></p>
<p><s>其实我是一名rapper</s></p>
<p>摊牌了，其实是一名大二理工男😋</p>
<p>现就读于北京某211电子信息科学与技术专业，偏向硬件。
然而由于种种原因，一直割舍不下前端相关，所以现在属于是忙里偷学。
在bilibili这片汪洋大海中学了很多乱七八糟的东西，前端相关、cad建模、视频剪辑与制作、电路设计、PCB设计、单片机......
回望大一，最开始对自己的规划是：前端（主业）+ 平面设计（兼职），（然而那时我的专业是电子信息类，主副业都八竿子打不着，这种想法多多少少有些幼稚了哈哈哈哈💁）犹记得我在大一就开始在网上找平面设计相关兼职（是否有点离谱..？）当时一是想把劳动技能变现，二是想锻炼锻炼，看过黑光网、猪八戒、站酷......然而很快就放弃了，一是觉得信息冗杂不能确定是否靠谱，二是竞争激烈。现在纯粹当做兴趣了。</p>
<p>前端相关的东西，现在也当做兴趣了。</p>
<p>经过了大一和大二上，现在模模糊糊有一个规划是从事单片机/嵌入式开发这一类。</p>
<p>未来如何，尚未可知。</p>
<p>我相信只要经历得足够多，选择的时候就不会彷徨。</p>
<h2 id="兴趣" tabindex="-1"><a class="header-anchor" href="#兴趣" aria-hidden="true">#</a> 兴趣</h2>
<p>运动：篮球🏀、running🏃
游戏：LOL🎮
设计：photoshop、AE
编程：前端相关、单片机</p>
<p>当然，必要时学业📋 &gt;&gt; others</p>
<h2 id="some-summary" tabindex="-1"><a class="header-anchor" href="#some-summary" aria-hidden="true">#</a> Some  Summary</h2>
<p>虽然学了很多不同方面的知识技能，然而并不是样样都很精通。而在我的专业中，这是很忌讳的。我希望在将来的专业课学习中，注重学习的深度。</p>
<hr>
<p>先写到这吧，以后有时间再作补充。</p>
</div></template>


